// Да се напише програма, която чете едно цяло число N, въведено от потребителя, и генерира всички възможни "специални" числа от 1111 до 9999. За да бъде "специално" едно число, то трябва да отговаря на следното условие: 
// •	N да се дели на всяка една от неговите цифри без остатък.

function specialNumbers(input) {

    let n = Number(input[0]);
    let result = ``;

    for (a = 1; a <= 9; a++) {

        for (b = 1; b <= 9; b++) {

            for (c = 1; c <= 9; c++) {

                for (d = 1; d <= 9; d++) {

                    if (n % a === 0 && n % b === 0 && n % c === 0 && n % d === 0) {

                        result += `${a}${b}${c}${d} `
                    }
                }
            }
        }
    }
    console.log(result);
}
specialNumbers(["3"])
// specialNumbers(["11"])
// specialNumbers(["16"])
