// Поздравления, поради вашите задълбочени знания в сферата на програмирането МВР реши да наеме точно вас за създаването на новата им система за генериране на специални автомобилни номера. Всеки един специален автомобилен номер се състой от четири числа. Условията, които разграничават специалните от обикновените номера са следните: 
// •	Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – ако започва с нечетна,  завършва на четна
// •	Първата цифра от номера е по-голяма от последната
// •	Сумата от втората и третата цифра трябва да е четно число
// Входа се състой от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.


function carNumber(input) {

    let beg = Number(input[0]);
    let end = Number(input[1]);

    let printLine = ``;

    for (let i = beg; i <= end; i++) {
        for (let y = beg; y <= end; y++) {
            for (let j = beg; j <= end; j++) {
                for (let k = beg; k <= end; k++) {

                    if ((i % 2 == 0) && (k % 2 !== 0) && i > k && (y + j) % 2 === 0) {

                        printLine += `${i}${y}${j}${k} `

                    } else if ((i % 2 !== 0) && (k % 2 === 0) && i > k && (y + j) % 2 === 0) {

                        printLine += `${i}${y}${j}${k} `

                    }

                }
            }
        }
    }
    console.log(printLine);

}
// carNumber([
//     2,
//     3,
// ])

// carNumber([
//     3,
//     5
// ])

carNumber([
    5,
    8
])
