// Провокирани от сватбата си, Михаела и Иван решават да предоставят нова услуга на клиенти на ресторанта си, а именно вечеря за запознанства - "Предизвикай Сватбата". Напишете програма, която отпечатва всички възможни срещи на клиентите на ресторанта. При настаняване всеки мъж и всяка жена получават талончета с поредни номера стартирайки от 1. Ако бъдат заети всички маси, програмата трябва да приключи. Всяка маса има две места.
// Вход: От конзолата се четат точно 3 числа, всяко на отделен ред:
// •	Броя клиенти мъже - цяло число в интервала [1...100]
// •	Броя клиенти жени - цяло число в интервала [1...100]
// •	Максималният брой маси - цяло число в интервала [1...100]
// Изход: На конзолата се принтират на един ред, разделени с интервал всички срещи в следният формат:
// •	({№ клиент} <-> {№ клиент}) ({№ клиент} <-> {№ клиент}) ...

function challengeTheWedding(input) {

    let maleClients = Number(input[0]);
    let femaleClients = Number(input[1]);
    let tables = Number(input[2]);

    let counter = 0;
    let couples = ``;

    for (let i = 1; i <= maleClients; i++) {
        for (let j = 1; j <= femaleClients; j++) {

            counter++;
            couples += `(${i} <-> ${j}) `

            if (counter === tables) {
                break;
            }

        }

        if (counter === tables) {
            break;
        }

    }
    console.log(couples);
}
challengeTheWedding([
    2,
    2,
    6
])

// challengeTheWedding([
//     2,
//     2,
//     3
// ])

// challengeTheWedding([
//     5,
//     8,
//     40
// ])
