// Да се напише програма, която прочита едно цяло число N и генерира всички възможни "щастливи" и различни 4-цифрени числа(всяка цифра от числото е в интервала [1...9]). 
// Числото трябва да отговаря на следните условия: 
// Щастливо число е 4-цифрено число, на което сбора от първите две цифри е равен на сбора от последните две. Числото N трябва да се дели без остатък от сбора на първите две цифри на "щастливото" число.


function luckyNumbers(input) {

    let n = Number(input[0]);
    let printLine = ``;

    for (let i = 1; i <= 9; i++) {
        for (let y = 1; y <= 9; y++) {
            for (let j = 1; j <= 9; j++) {
                for (let k = 1; k <= 9; k++) {

                    if ((i + y) == (j + k) && n % (i + y) === 0) {

                        printLine += `${i}${y}${j}${k} `;   //ако тук вместо printLine директно Console.log- резултатите излизат на нови редове
                    }

                }
            }
        }
    }
    console.log(printLine);

}
luckyNumbers([3])
// luckyNumbers([7])
// luckyNumbers([24])
